In [2]:
import pandas as pd
import numpy as np

# Using an array

In [4]:
# Create an array
data = np.array([[1,4], [2,5], [3,6]])

In [9]:
# Create a dataframe
df = pd.DataFrame(data, index = ['row1', 'row2', 'row3'], columns = ['col1', 'col2'])

In [10]:
#Showing the dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# Opction2

In [11]:
# Creating an array with list shape
data = [[1,4], [2,5], [3,6]]

In [12]:
#Creating the dataframe
df = pd.DataFrame(data, index = ['row1', 'row2', 'row3'], columns = ['col1', 'col2'])

In [13]:
#Showing the dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

#  Creating a dataframe from a dictionary

In [14]:
#List used for this example
states = ['California', 'Texas', 'Florida', 'New York']
population = [38613493, 29730311, 21944577, 19299981]

In [15]:
#Strong lists within a dictionary
dict_states = {'States': states, 'Population': population}

In [17]:
# Creating a dataframe
df_population = pd.DataFrame(dict_states)

In [18]:
#Showing the dataframe
df_population

       States  Population
0  California    38613493
1       Texas    29730311
2     Florida    21944577
3    New York    19299981

# Dataframe from a CSV file

In [20]:
#read a csv file
df_exams = pd.read_csv('StudentsPerformance.csv')

In [21]:
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75